Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutIsBlankOrError
source: Checks whether the expression results in blank result or an error, and returns true or false.
bg_bg: Проверява дали резултатът от израза е празен, или грешка, и дали връща true, или false.
ca_es: Comprova si l'expressió proporciona un resultat en blanc o un error, i retorna "true" o "false".
cs_cz: Zkontroluje, jestli je výsledek výrazu prázdný nebo chyba, a vrátí hodnotu true, nebo false.
da_dk: Kontrollerer, om udtrykket giver et tomt resultat og returnerer sand eller falsk.
de_de: Überprüft, ob der Ausdruck zu einem leeren Ergebnis oder einem Fehler führt, und gibt TRUE oder FALSE zurück.
el_gr: Ελέγχει εάν η παράσταση οδηγεί σε κενό αποτέλεσμα ή σε σφάλμα, και επιστρέφει την τιμή true ή false.
es_es: Comprueba si la expresión devuelve un resultado en blanco o un error, y devuelve TRUE o FALSE.
et_ee: Kontrollib, kas avaldise tulemus on tühiväärtusega või tõrkega, ja tagastab väärtuse Tõene või Väär.
eu_es: Espresioaren emaitza "hutsik dago" edo "errorea" den egiaztatzen du, eta "true" edo "false" itzultzen du.
fi_fi: Tarkistaa, onko lausekkeen tulos tyhjä tai virhe, ja palauttaa arvon true tai false.
fr_fr: Vérifie si l’expression donne un résultat vide ou une erreur, puis retourne True ou False.
gl_es: Comproba se a expresión dá lugar a un resultado en branco ou un erro e devolve verdadeiro ou falso.
hi_in: यह जाँचता है कि क्या व्यंजक का परिणाम रिक्त परिणाम है या कोई त्रुटि है, और ट्रू या फ़ॉल्स लौटाता है.
hr_hr: Provjerava je li rezultat izraza prazan ili pogreška i vraća true ili false.
hu_hu: Azt ellenőrzi, hogy üres értéket vagy hibát ad-e eredményül a kifejezés, és a true (igaz) vagy a false (hamis) értéket adja vissza.
it_it: Verifica se l'espressione produce un risultato vuoto o un errore e restituisce vero o falso.
ja_jp: 式の結果が空白またはエラーかどうかをチェックし、True または False を返します。
kk_kz: Өрнектің бос нәтиже немесе қате болуын не болмауын тексереді және "шын" немесе "жалған" мәнін қайтарады.
ko_kr: 식의 결과가 비었는지 또는 오류가 있는지 확인하고 true나 false를 반환합니다.
lt_lt: Tikrina, ar reiškinio rezultatas yra tuščia reikšmė ar klaida, ir pateikia „true“ arba „false“.
lv_lv: Pārbauda, vai izteiksmes rezultāts ir tukšs vai izraisa kļūdu, un atgriež vērtību “true” vai “false”.
ms_my: Menyemak sama ada ungkapan menghasilkan keputusan kosong atau ralat, dan mengembalikan benar atau palsu.
nb_no: Kontrollerer om uttrykket resulterer i en tom verdi eller en feil, og returnerer sann eller usann.
nl_nl: Hiermee wordt gecontroleerd of de expressie in lege waarden of fouten resulteert en wordt waar of onwaar geretourneerd.
pl_pl: Sprawdza, czy wynikiem wyrażenia jest pusty wynik lub błąd, i zwraca wartość prawda lub fałsz.
pt_br: Verifica se a expressão resulta em branco ou um erro, e retorna true ou false.
pt_pt: Verifica se a expressão resulta em branco ou num erro e devolve verdadeiro ou falso.
ro_ro: Verifică dacă expresia are ca rezultat un rezultat necompletat sau o eroare și returnează true sau false.
ru_ru: Проверяет, дает ли выражение пустой результат или ошибку, и возвращает true (истина) или false (ложь).
sk_sk: Skontroluje, či je výsledok výrazu prázdna hodnota alebo chyba, a vráti hodnotu true alebo false.
sl_si: Preveri, ali je rezultat izraza prazen oziroma napaka in vrne »true« ali »false«.
sr_cyrl_rs: Проверава да ли је резултат израза празан или је грешка, и враћа исправно или погрешно.
sr_latn_rs: Proverava da li je rezultat izraza prazan ili je greška, i vraća ispravno ili pogrešno.
sv_se: Kontrollerar om uttrycket resulterar i ett tomt resultat eller i ett fel, och returnerar sant eller falskt.
th_th: ตรวจสอบว่านิพจน์ส่งผลให้เกิดผลลัพธ์ที่ว่างเปล่าหรือมีข้อผิดพลาด และส่งกลับค่า จริง หรือ เท็จ
tr_tr: İfadenin boş sonuçla veya hatayla sonuçlanıp sonuçlanmadığını denetler ve true veya false değeri döndürür.
uk_ua: Перевіряє, результат виразу пустий чи містить помилку, і повертає значення true або false.
vi_vn: Kiểm tra xem kết quả biểu thức trong kết quả trống hoặc lỗi không và trả về True hay False.
zh_cn: 检查表达式是否生成空白结果或错误，并返回 true 或 false。
zh_tw: 檢查運算式是否導致空白的結果或錯誤，並傳回 true 或 false。

# IsBlankOrErrorArg1
source: expression
bg_bg: израз
ca_es: expressió
cs_cz: výraz
da_dk: udtryk
el_gr: παράσταση
es_es: expresión
et_ee: avaldis
eu_es: espresioa
fi_fi: lauseke
gl_es: expresión
hi_in: व्यंजक
hr_hr: izraz
hu_hu: kifejezés
it_it: espressione
ja_jp: 式
kk_kz: өрнек
ko_kr: 식
lt_lt: reiškinys
lv_lv: izteiksme
ms_my: ungkapan
nb_no: uttrykk
nl_nl: expressie
pl_pl: wyrażenie
pt_br: expressão
pt_pt: expressão
ro_ro: expresie
ru_ru: выражение
sk_sk: výraz
sl_si: izraz
sr_cyrl_rs: израз
sr_latn_rs: izraz
sv_se: uttryck
th_th: นิพจน์
tr_tr: ifade
uk_ua: вираз
vi_vn: biểu_thức
zh_cn: 表达式
zh_tw: 運算式

# AboutIsEmpty
source: Checks if a collection is empty and returns true or false.
bg_bg: Проверява дали колекцията е празна и връща true или false.
ca_es: Comprova si una col·lecció és buida i retorna true o false.
cs_cz: Zkontroluje, jestli je kolekce prázdná, a vrátí hodnotu true nebo false.
da_dk: Kontrollerer, om en samling er tom, og returnerer sand eller falsk.
de_de: Überprüft, ob eine Sammlung leer ist, und gibt WAHR oder FALSCH zurück.
el_gr: Ελέγχει εάν μια συλλογή είναι κενή και επιστρέφει true ή false.
es_es: Comprueba si una colección está vacía y devuelve TRUE o FALSE.
et_ee: Kontrollib, kas kogum on tühi, ja tagastab väärtuse Tõene või Väär.
eu_es: Bilduma hutsik dagoen egiaztatzen du eta "egia" edo "faltsua" balioa itzultzen du.
fi_fi: Tarkistaa, onko kokoelma tyhjä, ja palauttaa arvon tosi tai epätosi.
fr_fr: Vérifie si une collection est vide, puis retourne Vrai ou Faux.
gl_es: Comproba se unha colección está baleira e devolve verdadeiro ou falso.
hi_in: जाँचता है कि कोई संग्रह रिक्त है या नहीं और सत्य या असत्य लौटाता है.
hr_hr: Provjerava je li zbirka prazna i vraća true ili false.
hu_hu: Megvizsgálja, hogy üres-e egy gyűjtemény, és a true vagy a false értéket adja vissza.
it_it: Verifica se una raccolta è vuota e restituisce vero o falso.
ja_jp: コレクションが空かどうかをチェックし、True または False を返します。
kk_kz: Жиынтықтың бос болуын не болмауын тексереді және "шын" немесе "жалған" мәнін қайтарады.
ko_kr: 컬렉션이 비어 있는지 여부를 확인하고 true나 false를 반환합니다.
lt_lt: Tikrina, ar rinkinys yra tuščias, ir pateikia reikšmę TRUE arba FALSE.
lv_lv: Pārbauda, vai kolekcija ir tukša, un atgriež vērtību "true" vai "false".
ms_my: Menyemak jika koleksi kosong dan mengembalikan benar atau palsu.
nb_no: Kontrollerer om en samling er tom, og returnerer sann eller usann.
nl_nl: Hiermee wordt gecontroleerd of een verzameling leeg is en wordt waar of onwaar geretourneerd.
pl_pl: Sprawdza, czy kolekcja jest pusta, i zwraca wartość prawda lub fałsz.
pt_br: Verifica se uma coleção está vazia e retorna verdadeiro ou falso.
pt_pt: Verifica se uma coleção está vazia e devolve verdadeiro ou falso.
ro_ro: Verifică dacă o colecție este goală și returnează adevărat sau fals.
ru_ru: Проверяет, пуста ли коллекция, и возвращает true или false.
sk_sk: Skontroluje, či je kolekcia prázdna, a vráti výsledok pravda alebo nepravda.
sl_si: Preveri, če je zbirka prazna in vrne »true« ali »false«.
sr_cyrl_rs: Проверава да ли је колекција празна и враћа исправно или погрешно.
sr_latn_rs: Proverava da li je kolekcija prazna i vraća ispravno ili pogrešno.
sv_se: Kontrollerar om en samling är tom och returnerar sant eller falskt.
th_th: ตรวจสอบว่าคอลเลกชันว่างเปล่าหรือไม่ และคืนค่า true หรือ false
tr_tr: Bir koleksiyonun boş olup olmadığını denetler ve true veya false değeri döndürür.
uk_ua: Перевіряє, чи колекція пуста, і надає результат у форматі істина-хибність.
vi_vn: Kiểm tra xem bộ sưu tập có bị trống hay không và trả về giá trị đúng hoặc sai.
zh_cn: 检查集合是否为空并返回 true 或 false。
zh_tw: 檢查集合是否是空的，並傳回 True 或 False。

# IsEmptyArg1
source: source
bg_bg: източник
ca_es: origen
cs_cz: zdroj
da_dk: kilde
de_de: Quelle
el_gr: προέλευση
es_es: origen
et_ee: allikas
eu_es: iturburua
fi_fi: lähde
gl_es: orixe
hi_in: स्रोत
hr_hr: izvor
hu_hu: forrás
it_it: origine
ja_jp: ソース
kk_kz: деректер_көзі
ko_kr: 원본
lt_lt: šaltinis
lv_lv: avots
ms_my: sumber
nb_no: kilde
nl_nl: bron
pl_pl: źródło
pt_br: fonte
pt_pt: origem
ro_ro: sursă
ru_ru: источник
sk_sk: zdroj
sl_si: vir
sr_cyrl_rs: извор
sr_latn_rs: izvor
sv_se: källa
th_th: แหล่งที่มา
tr_tr: kaynak
uk_ua: джерело
vi_vn: nguồn
zh_cn: 源
zh_tw: 來源

# AboutShuffle
source: Returns a randomly shuffled copy of the input 'source' table.
bg_bg: Връща произволно разбъркано копие на входната таблица на „източник“.
ca_es: Retorna una còpia ordenada aleatòriament de la taula 'source' d'entrada.
cs_cz: Vrátí kopii vstupní zdrojové tabulky náhodně přeházenou metodou shuffle.
da_dk: Returnerer en vilkårligt blandet kopi af input-'kilde'-tabellen.
de_de: Gibt eine zufällig durchmischte Kopie der Eingabetabelle "Quelle" zurück.
el_gr: Επιστρέφει ένα αντίγραφο με τυχαία σειρά του πίνακα "προέλευσης" εισόδου.
es_es: Devuelve una copia ordenada aleatoriamente de la tabla de entrada de origen.
et_ee: Tagastab sisestatud allikatabeli juhuslikult segatud kirjetega koopia.
eu_es: Sarrerako "source" taularen ausazko kopia bat itzultzen du.
fi_fi: Palauttaa syötteen source-taulukon satunnaisesti sekoitetun kopion.
fr_fr: Retourne une copie aléatoire de la table « source » d’entrée.
gl_es: Devolve unha copia ordenada aleatoriamente da táboa de "orixe" de entrada.
hi_in: इनपुट 'source' तालिका की यादृच्छिक रूप से शफ़ल की गई प्रतिलिपि लौटाता है.
hr_hr: Vraća nasumično izmiješanu kopiju ulazne tablice "izvora".
hu_hu: A bemeneti „forrás” tábla véletlenszerűen felcserélt adatokat tartalmazó példányát adja vissza.
it_it: Restituisce una copia selezionata in ordine casuale della tabella 'origine' di input.
ja_jp: 入力 'ソース' テーブルのランダムにシャッフルされたコピーを返します。
kk_kz: Кіріс бастапқы кестенің кездейсоқ көшірмесін қайтарады.
ko_kr: 입력 '원본' 테이블의 무작위로 순서를 섞은 복사본을 반환합니다.
lt_lt: Pateikia įvesties šaltinio lentelės atsitiktine tvarka sumaišytą kopiją.
lv_lv: Atgriež nejauši sajauktu ievades tabulas "source" kopiju.
ms_my: Mengembalikan salinan yang disusun semula secara rawak jadual 'sumber' input.
nb_no: Returnerer en kopi i tilfeldig rekkefølge av inndatakildetabellen.
nl_nl: Hiermee wordt een kopie van de invoertabel 'source' met een willekeurige volgorde weergegeven.
pl_pl: Zwraca losowo pomieszaną kopię tabeli wejściowej „źródło”.
pt_br: Retorna uma cópia da tabela de 'source' (origem) de entrada, selecionada aleatoriamente.
pt_pt: Devolve uma cópia aleatória da tabela de "origem" de entrada.
ro_ro: Returnează o copie amestecată aleator a tabelului „sursă” de intrare.
ru_ru: Возвращает копию входной таблицы "источника" со строками, перемешанными в случайном порядке.
sk_sk: Vráti náhodne vybratú kópiu vstupnej tabuľky zdroja.
sl_si: Vrne naključno premešano kopijo vhodne tabele argumenta »vir«.
sr_cyrl_rs: Враћа насумично измешану копију улазне табеле „извор“.
sr_latn_rs: Vraća nasumično izmešanu kopiju ulazne tabele „izvor“.
sv_se: Returnerar en slumpmässigt blandad kopia av indatakälltabellen.
th_th: ส่งคืนสำเนาที่สลับแบบสุ่มของตารางอินพุต 'source'
tr_tr: Giriş 'source' tablosunun rastgele karıştırılmış bir kopyasını döndürür.
uk_ua: Повертає копію вихідної таблиці з вхідними даними, перетасованими в довільному порядку.
vi_vn: Trả về một bản sao của bảng 'nguồn' đầu vào được trộn ngẫu nhiên.
zh_cn: 返回输入 "source" 表的随机选择副本。
zh_tw: 傳回輸入 'source' 資料表的隨機複本。

# ShuffleArg1
source: source
bg_bg: източник
ca_es: origen
cs_cz: zdroj
da_dk: kilde
de_de: Quelle
el_gr: προέλευση
es_es: origen
et_ee: allikas
eu_es: iturburua
fi_fi: lähde
gl_es: orixe
hi_in: स्रोत
hr_hr: izvor
hu_hu: forrás
it_it: origine
ja_jp: ソース
kk_kz: деректер_көзі
ko_kr: 원본
lt_lt: šaltinis
lv_lv: avots
ms_my: sumber
nb_no: kilde
nl_nl: bron
pl_pl: źródło
pt_br: fonte
pt_pt: origem
ro_ro: sursă
ru_ru: источник
sk_sk: zdroj
sl_si: vir
sr_cyrl_rs: извор
sr_latn_rs: izvor
sv_se: källa
th_th: แหล่งที่มา
tr_tr: kaynak
uk_ua: джерело
vi_vn: nguồn
zh_cn: 源
zh_tw: 來源

# AboutShuffle_source
source: A table to be shuffled.
bg_bg: Таблица за разбъркване.
ca_es: Taula que s'ordenarà aleatòriament.
cs_cz: Tabulka, která má být náhodně přeházena
da_dk: En tabel, der skal blandes.
de_de: Eine zu durchmischende Tabelle.
el_gr: Πίνακας για τυχαία σειρά.
es_es: Una tabla que se va a ordenar aleatoriamente.
et_ee: Segatav tabel.
eu_es: Ausaz ordenatuko den taula.
fi_fi: Sekoitettava taulukko.
fr_fr: Table à lire aléatoirement.
gl_es: Táboa que se vai ordenar aleatoriamente.
hi_in: शफ़ल की जाने वाली तालिका.
hr_hr: Tablica koja će se izmiješati.
hu_hu: A véletlen sorrendbe állítandó tábla.
it_it: Tabella da selezionare in ordine casuale.
ja_jp: シャッフルするテーブル。
kk_kz: Кездейсоқ ретпен араластырылатын кесте.
ko_kr: 순서를 섞을 테이블입니다.
lt_lt: Lentelė, kurią reikia sumaišyti.
lv_lv: Jaucamā tabula.
ms_my: Jadual untuk dikocok.
nb_no: En tabell som skal blandes.
nl_nl: Een tabel die in willekeurige volgorde moet worden weergegeven.
pl_pl: Tabela, której zawartość zostanie pomieszana.
pt_br: Tabela a ser selecionada aleatoriamente.
pt_pt: Uma tabela a ser aleatorizada.
ro_ro: Un tabel care va fi amestecat.
ru_ru: Таблица для смешения.
sk_sk: Tabuľka na náhodný výber.
sl_si: Tabela, ki bo premešana.
sr_cyrl_rs: Табела коју треба измешати.
sr_latn_rs: Tabela koju treba izmešati.
sv_se: En tabell att blandas.
th_th: ตารางที่จะสุ่ม
tr_tr: Karıştırılacak bir tablo.
uk_ua: Таблиця, дані якої потрібно перетасувати.
vi_vn: Bảng cần trộn.
zh_cn: 要随机选择的表。
zh_tw: 隨機排列的資料表。

# AboutLookUp
source: Looks up the first row for which the specified condition evaluates to true and returns the result of expression evaluated within the context of that row if provided an expression and the entire row otherwise.
bg_bg: Търси първия ред, за който указаното условие се изчислява като true, и връща резултата от израза, изчислен в контекста на този ред, ако е предоставен израз, или целия ред, ако не е.
ca_es: Cerca la primera fila en què la condició especificada s'avalua com a true i retorna el resultat de l'expressió avaluada en el context de la fila si s'ha proporcionat una expressió i tota la fila.
cs_cz: Prohledá první řádek, pro který se zadaná podmínka vyhodnotí jako pravdivá, a vrátí výsledek výrazu vyhodnoceného v kontextu tohoto řádku (pokud je výraz zadaný), v opačném případě celý řádek.
da_dk: Slår den første række op, hvor den angivne tilstand evalueres som sand, og returnerer resultatet af udtrykket, der evalueres inden for denne rækkes kontekst, hvis den får et udtryk, ellers hele rækken.
de_de: Schlägt die erste Zeile nach, für die die angegebene Bedingung als WAHR ausgewertet wird, und gibt das Ergebnis des im Kontext dieser Zeile ausgewerteten Ausdrucks zurück, wenn ein Ausdruck übergeben wurde. Andernfalls wird die gesamte Zeile zurückgegeben.
el_gr: Αναζητά την πρώτη σειρά για την οποία η καθορισμένη συνθήκη αξιολογείται σε true και επιστρέφει το αποτέλεσμα μιας παράστασης που αξιολογείται εντός του περιβάλλοντος αυτής της σειράς, εφόσον παρέχεται μια παράσταση και ολόκληρη η σειρά.
es_es: Busca la primera fila en la que la condición especificada se evalúa como TRUE y devuelve el resultado de la expresión evaluada en el contexto de esa fila si se ha proporciona una expresión, y toda la fila en caso contrario.
et_ee: Otsib esimese rea, mille puhul määratud tingimuse väärtus on tõene, ja tagastab selle rea kontekstis arvutatud avaldise tulemuse, kui esitatud avaldis ja kogu rida on teistsugused.
eu_es: Zehaztutako baldintza egia gisa ebaluatuta duen lehen errenkada bilatzen du eta, espresio bat eman bada, errenkada horren testuinguruan ebaluatutako espresioaren emaitza itzultzen du; horrela ez bada, errenkada osoaren emaitza itzultzen du.
fi_fi: Etsii ensimmäisen rivin, jolle määritetyn ehdon arvioiminen antaa arvon tosi, ja palauttaa arvioidun lausekkeen tuloksen kyseisen rivin kontekstissa, jos lauseke annetaan, ja muussa tapauksessa koko rivin.
fr_fr: Recherche la première ligne pour laquelle la condition spécifiée est vraie, et renvoie le résultat de l’expression évaluée dans le contexte de cette ligne si une expression est fournie, ou la ligne entière dans le cas contraire.
gl_es: Consulta a primeira fila na que a condición especificada se avalía como verdadeira e devolve o resultado da expresión avaliada dentro do contexto de dita fila en caso de que se forneza unha expresión ou toda a fila.
hi_in: वह पहली पंक्ति खोजता है जिसके लिए निर्दिष्ट स्थिति का मूल्यांकन सत्य में होता है और उस पंक्ति के संदर्भ में मूल्यांकित व्यंजक का परिणाम लौटाता है बशर्ते कोई व्यंजक दिया गया हो अन्यथा पूरी पंक्ति दी गई हो.
hr_hr: Pretražuje prvi redak za koji se određeni uvjet vrednuje na true i vraća rezultat izraza koji se vrednuje unutar konteksta tog retka ako je naveden izraz, a u suprotnom cijeli redak.
hu_hu: Kikeresi azt az első sort, amelyen a feltétel kiértékelése igaz eredményt ad, és ha meg van adva egy kifejezés, visszaadja annak az adott sorra vonatkozóan kiértékelt eredményét, ellenkező esetben az egész sort.
it_it: Cerca la prima riga per la quale la condizione specificata restituisce vero e restituisce il risultato dell'espressione valutata nel contesto della riga se è stata specificata un'espressione. In caso contrario, restituisce l'intera riga.
ja_jp: 指定した条件が true として評価され、式を指定した場合はその行のコンテキスト内、指定しない場合は行全体で評価された式の結果を返す最初の行を検索します。
kk_kz: Көрсетілген шарт "шын" ретінде есептелетін бірінші жолды іздейді және сол жолдың контекстінде есептелген өрнектің нәтижесін қайтарады.
ko_kr: 지정된 조건이 true로 평가한 첫 번째 행을 조회하고 그렇지 않으면 식 및 전체 행이 제공된 경우에는 해당 행의 컨텍스트 내에서 평가된 식의 결과를 반환합니다.
lt_lt: Ieško pirmos eilutės, kurioje pirma sąlyga įvertinama kaip TRUE, ir pateikia rezultatą reiškinio, apskaičiuotą tos eilutės kontekste, jei nurodytas reiškinys, kitu atveju pateikiama visa eilutė.
lv_lv: Uzmeklē pirmo rindu, kurai norādītais nosacījums tiek novērtēts uz "true", un atgriež tās izteiksmes rezultātu, kas novērtēta šīs rindas kontekstā, ja ir nodrošināta izteiksme, bet pretējā gadījumā visu izteiksmi.
ms_my: Mencari baris pertama yang syarat ditentukan menilai kepada benar dan mengembalikan hasil ungkapan yang dinilai dalam konteks baris itu jika diberikan ungkapan dan seluruh baris sebaliknya.
nb_no: Slår opp den første raden som den angitte betingelsen evalueres til sann for, og returnerer resultatet av uttrykket evaluert i konteksten for denne raden hvis et uttrykk angis, og hele raden ellers.
nl_nl: Hiermee wordt de eerste rij gezocht waarvoor de opgegeven voorwaarde resulteert in waar en wordt het resultaat van de evaluatie van de expressie in de context van die rij geretourneerd als er een expressie is opgegeven. Anders wordt het resultaat voor de hele rij geretourneerd.
pl_pl: Wyszukuje pierwszy wiersz, dla którego określony warunek jest spełniony, i zwraca wynik wyrażenia ocenianego w kontekście tego wiersza, jeśli zostało podane. W przeciwnym razie zwraca cały wiersz.
pt_br: Procura a primeira linha em que a condição especificada é avaliada como verdadeira e retorna o resultado da expressão avaliada dentro do contexto daquela linha, se uma expressão for fornecida, ou a linha inteira, se não for.
pt_pt: Procura a primeira linha na qual a condição especificada avalia como verdeiro e devolve o resultado da expressão avaliada no contexto dessa linha, se tiver sido fornecida uma expressão e a linha inteira.
ro_ro: Caută primul rând pentru care condiția specificată este evaluată la adevărat și returnează rezultatul expresiei evaluate în contextul acelui rând, dacă este furnizată o expresie, sau întregul rând în caz contrar.
ru_ru: Ищет первую строку, для которой указанное условие имеет значение true. Возвращает результат выражения, вычисленный в контексте этой строки, если строка указана, или всю строку в противном случае.
sk_sk: Vyhľadá prvý riadok, pre ktorý sa zadaná podmienka vyhodnotí ako pravdivá, a vráti výsledok výrazu vyhodnoteného v rámci kontextu daného riadka, ak tento poskytol výraz – v opačnom prípade celý riadok.
sl_si: Poišče prvo vrstico, za katero je določen pogoj ovrednoten za resničnega in vrne rezultat izraza, ovrednotenega v okviru te vrstice, če je izraz podan, sicer pa celotno vrstico.
sr_cyrl_rs: Тражи први ред за који наведени услов има вредност исправно и враћа резултат израза проверен у оквиру контекста тог реда ако је обезбеђен израз и цео ред.
sr_latn_rs: Traži prvi red za koji navedeni uslov ima vrednost ispravno i vraća rezultat izraza proveren u okviru konteksta tog reda ako je obezbeđen izraz i ceo red.
sv_se: Hittar den första raden som det angivna villkoret utvärderar som sant och returnerar resultatet av uttrycket som utvärderats inom kontexten för den raden ifall att den givits ett uttryck, annars för hela raden.
th_th: ค้นหาข้อมูลแถวแรกที่เงื่อนไขการประเมินเป็น true และส่งกลับค่านิพจน์ที่ประเมินจากบริบทของข้อมูลแถวนั้นในกรณีที่มีการระบุนิพจน์ มิฉะนั้นให้ส่งกลับค่าทั้งแถว
tr_tr: Belirtilen koşulun true olarak değerlendirildiği ilk satırı arar. İfade sağlandıysa ifadenin bu satır bağlamında değerlendirilen sonucunu, sağlanmadıysa tüm satırı döndürür.
uk_ua: Шукає перший рядок, що відповідає вказаній умові, і повертає результат обчислення виразу стосовно цього рядка, а якщо вираз не вказано – увесь рядок.
vi_vn: Tra cứu hàng đầu tiên mà điều kiện được chỉ định đánh giá cho hàng này là đúng và trả về kết quả biểu thức được đánh giá trong phạm vi ngữ cảnh của hàng đó nếu trong trường hợp khác được cung cấp biểu thức và toàn bộ hàng.
zh_cn: 如果提供一个表达式和整行，则查找指定条件计算结果为 true 的第一行，并返回在该行上下文中计算的表达式的结果。
zh_tw: 查閱第一個指定條件評估為 True 的資料列，如果有提供運算式，會在該資料列內容中傳回評估運算式的結果; 若沒有提供運算式，則會傳回整個資料列。

# LookUpArg1
source: source
bg_bg: източник
ca_es: origen
cs_cz: zdroj
da_dk: kilde
de_de: Quelle
el_gr: προέλευση
es_es: origen
et_ee: allikas
eu_es: iturburua
fi_fi: lähde
gl_es: orixe
hi_in: स्रोत
hr_hr: izvor
hu_hu: forrás
it_it: origine
ja_jp: ソース
kk_kz: деректер_көзі
ko_kr: 원본
lt_lt: šaltinis
lv_lv: avots
ms_my: sumber
nb_no: kilde
nl_nl: bron
pl_pl: źródło
pt_br: fonte
pt_pt: origem
ro_ro: sursă
ru_ru: источник
sk_sk: zdroj
sl_si: vir
sr_cyrl_rs: извор
sr_latn_rs: izvor
sv_se: källa
th_th: แหล่งที่มา
tr_tr: kaynak
uk_ua: джерело
vi_vn: nguồn
zh_cn: 源
zh_tw: 來源

# LookUpArg2
source: condition
bg_bg: условие
ca_es: condició
cs_cz: podmínka
da_dk: betingelse
de_de: Bedingung
el_gr: συνθήκη
es_es: condición
et_ee: tingimus
eu_es: baldintza
fi_fi: ehto
gl_es: condición
hi_in: स्थिति
hr_hr: stanje
hu_hu: feltétel
it_it: condizione
ja_jp: 条件
kk_kz: шарт
ko_kr: 조건
lt_lt: sąlyga
lv_lv: nosacījums
ms_my: syarat
nb_no: betingelse
nl_nl: voorwaarde
pl_pl: warunek
pt_br: condição
pt_pt: condição
ro_ro: condiție
ru_ru: условие
sk_sk: podmienka
sl_si: pogoj
sr_cyrl_rs: услов
sr_latn_rs: uslov
sv_se: villkor
th_th: เงื่อนไข
tr_tr: koşul
uk_ua: умова
vi_vn: điều_kiện
zh_cn: 条件
zh_tw: 條件

# LookUpArg3
source: result
bg_bg: резултат
ca_es: resultat
cs_cz: výsledek
da_dk: resultat
de_de: Ergebnis
el_gr: αποτέλεσμα
es_es: resultado
et_ee: tulemus
eu_es: emaitza
fi_fi: tulos
fr_fr: résultat
gl_es: resultado
hi_in: परिणाम
hr_hr: rezultat
hu_hu: eredmény
it_it: risultato
ja_jp: 結果
kk_kz: нәтиже
ko_kr: 결과
lt_lt: rezultatas
lv_lv: rezultāts
ms_my: hasil
nb_no: resultat
nl_nl: resultaat
pl_pl: wynik
pt_br: resultado
pt_pt: resultado
ro_ro: rezultat
ru_ru: результат
sk_sk: výsledok
sl_si: rezultat
sr_cyrl_rs: резултат
sr_latn_rs: rezultat
sv_se: resultat
th_th: ผลลัพธ์
tr_tr: sonuç
uk_ua: результат
vi_vn: kết_quả
zh_cn: 结果
zh_tw: 結果
